app/channels/application_cable/connection.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
		def connect
			# connection.rb doesn't have access to session
			user = User.find_by(:id => cookies.encrypted[:user_id]);