app/channels/pong_channel.rb

	def start(data)
		@playerLeft = User.find_by(:userid => data["playerLeft"]);
		@playerRight = User.find_by(:userid => data["playerRight"]);
---
SELECT "users".* FROM "users" WHERE "users"."userid" = $1 LIMIT $2  [["userid", "1"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."userid" = $1 LIMIT $2  [["userid", "0"], ["LIMIT", 1]]

	def reset(data)
		@playerLeft = User.find_by(:userid => data["playerLeft"]);
		@playerRight = User.find_by(:userid => data["playerRight"]);
---
SELECT "users".* FROM "users" WHERE "users"."userid" = $1 LIMIT $2  [["userid", "1"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."userid" = $1 LIMIT $2  [["userid", "0"], ["LIMIT", 1]]