app/channels/roomchat_channel.rb

	def subscribed
		@roomchat = Roomchat.find_by(roomname: params[:room])
		user = User.find_by(speudo: params[:speudo])
		if user
			if user.admin == false
				user.update(roomchat_id: @roomchat.id)
---
SELECT "roomchats".* FROM "roomchats" WHERE "roomchats"."roomname" = $1 LIMIT $2  [["roomname", "funRoom"], ["LIMIT", 1]]
UPDATE "users" SET "roomchat_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["roomchat_id", 1], ["updated_at", "2020-06-28 08:40:33.096484"], ["id", 1]]

	def unsubscribed
			@user = User.find_by(speudo: params[:speudo])
			if @user
					@user.update(roomchat_id: nil)
				@roomchat = Roomchat.find_by(roomname: params[:room])
				if @roomchat
					listuser = @roomchat.users.order("updated_at")
					if listuser.length > 0
						if @roomchat.owner == params[:speudo]
								@roomchat.update(owner: listuser.first.speudo)
								@roomchat.admins.create(speudo: listuser.first.speudo)
						end
						preparelistuser(@roomchat)
					else
						@roomchat.destroy
---
UPDATE "users" SET "roomchat_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["roomchat_id", nil], ["updated_at", "2020-06-28 08:40:38.967977"], ["id", 3]]
SELECT "roomchats".* FROM "roomchats" WHERE "roomchats"."roomname" = $1 LIMIT $2  [["roomname", "funRoom"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."roomchat_id" = $1 ORDER BY updated_at  [["roomchat_id", 1]]
SELECT "roomchats".* FROM "roomchats"
UPDATE "roomchats" SET "owner" = $1, "updated_at" = $2 WHERE "roomchats"."id" = $3  [["owner", "carl"], ["updated_at", "2020-06-28 08:40:39.024328"], ["id", 1]]
SELECT "admins".* FROM "admins" WHERE "admins"."roomchat_id" = $1  [["roomchat_id", 1]]
INSERT INTO "admins" ("speudo", "roomchat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["speudo", "carl"], ["roomchat_id", 1], ["created_at", "2020-06-28 08:40:39.070807"], ["updated_at", "2020-06-28 08:40:39.070807"]]
DELETE FROM "admins" WHERE "admins"."id" = $1  [["id", 1]]
DELETE FROM "roomchats" WHERE "roomchats"."id" = $1  [["id", 1]]

	def sendlistroom
		hash = Hash.new

		rooms = Roomchat.where('id > ?', 1)
		i = 0
		rooms.each do |room|
---
SELECT "roomchats".* FROM "roomchats" WHERE (id > 1)

	def preparelistuser(roomchat)
		hash = Hash.new
		listuser = roomchat.users.order("updated_at")
		i = 0
		listuser.each do |teste|
---
SELECT "users".* FROM "users" WHERE "users"."roomchat_id" = $1 ORDER BY updated_at  [["roomchat_id", 1]]