app/channels/status_channel.rb

	def subscribed
		current_user.status = "online";
		current_user.save();
---
UPDATE "users" SET "status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["status", "online"], ["updated_at", "2020-06-28 08:39:44.152502"], ["id", 1]]

	def unsubscribed
		current_user.status = "offline";
		current_user.save();
---
UPDATE "users" SET "status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["status", "offline"], ["updated_at", "2020-06-28 08:43:03.606873"], ["id", 3]]