app/controllers/guilds_controller.rb

SELECT "guilds".* FROM "guilds"
---
	def index
		guilds = Guild.all();

SELECT "guilds".* FROM "guilds" WHERE "guilds"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
	def showOfficer
		guild = Guild.find_by(id: params[:id])