app/controllers/guildwars_controller.rb

SELECT "guilds".* FROM "guilds" WHERE "guilds"."guildname" = $1 LIMIT $2  [["guildname", ""], ["LIMIT", 1]]
---
    def show
        guild = Guild.find_by(guildname: params[:guildname])