app/controllers/message_controller.rb

	def chatroom
		room = Roomchat.find_by(roomname: params[:roomname])
		if !room
			return
		end
		room.banlists.each do |t|
---
SELECT "roomchats".* FROM "roomchats" WHERE "roomchats"."roomname" = $1 LIMIT $2  [["roomname", "funRoom"], ["LIMIT", 1]]
SELECT "banlists".* FROM "banlists" WHERE "banlists"."roomchat_id" = $1  [["roomchat_id", 1]]