app/controllers/personnal_controller.rb

	def unmute
		user = User.includes('mutes').find_by(username: params[:speudo])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "carl"], ["LIMIT", 1]]