app/controllers/roomchat_controller.rb

	def index
		render(:json => Roomchat.all());
---
SELECT "roomchats".* FROM "roomchats" WHERE (id > 1)

	def create
		@room = Roomchat.find_by(roomname: params[:roomname])
		if @room
			sendpersonnal(params[:speudo], error: "a room with the name " + @room.roomname + " already exist")
		else
			@room = Roomchat.new
			@room.roomname = params[:roomname]
			@room.owner = params[:speudo]
			@room.password = params[:password] + "42"
			if @room.save
				@room.admins.create(speudo: params[:speudo])
---
SELECT "roomchats".* FROM "roomchats" WHERE "roomchats"."roomname" = $1 LIMIT $2  [["roomname", "funRoom"], ["LIMIT", 1]]
INSERT INTO "roomchats" ("roomname", "owner", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["roomname", "funRoom"], ["owner", "johnson"], ["password", "42"], ["created_at", "2020-06-28 08:40:29.370292"], ["updated_at", "2020-06-28 08:40:29.370292"]]
INSERT INTO "admins" ("speudo", "roomchat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["speudo", "johnson"], ["roomchat_id", 1], ["created_at", "2020-06-28 08:40:29.419942"], ["updated_at", "2020-06-28 08:40:29.419942"]]

	def join
		@room = Roomchat.includes('banlists').find_by(roomname: params[:roomname])
		if !@room
			return
		end
		user = User.find_by(username: params[:speudo])
---
SELECT "roomchats".* FROM "roomchats" WHERE "roomchats"."roomname" = $1 LIMIT $2  [["roomname", "funRoom"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "carl"], ["LIMIT", 1]]

	def game
		player = User.where(:status => "online").find_by(:username => params[:player]);
		enemy = User.where(:status => "online").find_by(:username => params[:enemy]);
		checkuser = User.find_by(username: params[:enemy])
---
SELECT "users".* FROM "users" WHERE "users"."status" = $1 AND "users"."username" = $2 LIMIT $3  [["status", "online"], ["username", "johnson"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."status" = $1 AND "users"."username" = $2 LIMIT $3  [["status", "online"], ["username", "carl"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "carl"], ["LIMIT", 1]]