app/controllers/root_controller.rb

INSERT INTO "users" ("userid", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["userid", "0"], ["username", "carl"], ["created_at", "2020-06-28 08:39:42.530939"], ["updated_at", "2020-06-28 08:39:42.530939"]]
SELECT "users".* FROM "users" WHERE "users"."userid" = $1 LIMIT $2  [["userid", "0"], ["LIMIT", 1]]
---
	def carl
		@user = User.find_by(:userid => "0") ||
				User.create({ :userid => "0", :username => "carl" });

INSERT INTO "users" ("userid", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["userid", "1"], ["username", "johnson"], ["created_at", "2020-06-28 08:39:44.404842"], ["updated_at", "2020-06-28 08:39:44.404842"]]
SELECT "users".* FROM "users" WHERE "users"."userid" = $1 LIMIT $2  [["userid", "1"], ["LIMIT", 1]]
---
	def johnson
		@user = User.find_by(:userid => "1") ||
				User.create({ :userid => "1", :username => "johnson" });