app/controllers/tournament_controller.rb

	def index
		users = User.where(:rank => params[:id]).select(:username).all();
---
SELECT "users"."username" FROM "users" WHERE "users"."rank" = $1  [["rank", 4]]