app/controllers/users_controller.rb

SELECT "users"."userid", "users"."username", "users"."status" FROM "users" WHERE (status like 'in a match%')
---
	def watch
		users = User.select(:userid, :username, :status);
		users = users.where("status like ?", "in a match%").all();

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users"."userid", "users"."username", "users"."status" FROM "users" WHERE ("users"."userid" = $1 OR "users"."status" = $2)  [["userid", "0"], ["status", "in a match with 0"]]
SELECT "users"."userid", "users"."username", "users"."status" FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_user_id" WHERE "friendships"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "johnson"], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."user_id" = $1  [["user_id", 1]]
---
	def index
		user = User.find_by(:id => session[:user_id]);
		if params[:id] == "friends"
			render(:json => user.friends.select(:userid, :username, :status).all());
		elsif params[:id] == "players"
			players = User.where(:userid => user.userid);
			players = players.or(User.where(:status => "in a match with #{user.userid}"));
			render(:json => players.select(:userid, :username, :status).all());
		elsif params[:id] == "matches"
			render(:json => user.matches.all());

UPDATE "users" SET "roomchat_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["roomchat_id", nil], ["updated_at", "2020-06-28 08:40:38.941970"], ["id", 3]]
---
	def update
		user = User.find_by(:id => session[:user_id]);
		permitted = params.require("user").permit(:username,
												  :status,
												  :TFA?,
												  :admin,
												  :match);
		user.update(permitted);

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		user = User.find_by(:id => session[:user_id]);