app/models/matchmaking.rb

	def self.make(first, second, match)
		if first.match == "none" && second.match == "none"
			first.update({ :status => "in a match with #{second.userid}",
						   :match => match });
			second.update({ :status => "in a match with #{first.userid}",
							:match => match });
---
UPDATE "users" SET "match" = $1, "status" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["match", "duel"], ["status", "in a match with 0"], ["updated_at", "2020-06-28 08:44:22.640733"], ["id", 3]]
UPDATE "users" SET "match" = $1, "status" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["match", "duel"], ["status", "in a match with 1"], ["updated_at", "2020-06-28 08:44:22.662934"], ["id", 1]]