app/models/pong.rb

	def self.pong_score_save(playerLeft, playerRight, scoreLeft, scoreRight)
		playerLeft.reload();
		playerRight.reload();
		if scoreLeft > scoreRight
			pong_score_guild(playerLeft);
			pong_score_ladder(playerLeft, playerRight);
			pong_score_deathmatch(playerRight);
			pong_score_user(playerLeft, playerRight);
		elsif scoreLeft < scoreRight
			pong_score_guild(playerRight);
			pong_score_ladder(playerRight, playerLeft);
			pong_score_deathmatch(playerLeft);
			pong_score_user(playerRight, playerLeft);
		end
		playerLeft.matches<<(Match.create({
			:playerLeft => playerLeft.userid,
			:playerRight => playerRight.userid,
			:scoreLeft => scoreLeft,
			:scoreRight => scoreRight,
			:matchType => playerLeft.match
			}));
		playerRight.matches<<(Match.create({
				:playerLeft => playerLeft.userid,
				:playerRight => playerRight.userid,
				:scoreLeft => scoreLeft,
				:scoreRight => scoreRight,
				:matchType => playerRight.match
				}));
---
INSERT INTO "matches" ("playerLeft", "playerRight", "scoreLeft", "scoreRight", "matchType", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["playerLeft", "1"], ["playerRight", "0"], ["scoreLeft", 2], ["scoreRight", 5], ["matchType", "duel"], ["created_at", "2020-06-28 08:45:18.655186"], ["updated_at", "2020-06-28 08:45:18.655186"]]
INSERT INTO "matches" ("playerLeft", "playerRight", "scoreLeft", "scoreRight", "matchType", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["playerLeft", "1"], ["playerRight", "0"], ["scoreLeft", 2], ["scoreRight", 5], ["matchType", "duel"], ["created_at", "2020-06-28 08:45:18.681790"], ["updated_at", "2020-06-28 08:45:18.681790"]]

		end
		playerLeft.match = "none";
		playerRight.match = "none";
		playerLeft.save();
---
UPDATE "matches" SET "user_id" = $1, "updated_at" = $2 WHERE "matches"."id" = $3  [["user_id", 1], ["updated_at", "2020-06-28 08:45:18.689467"], ["id", 2]]