app/models/warmatch.rb

SELECT "guildwars".* FROM "guildwars" WHERE "guildwars"."guild_1_id" IS NULL AND "guildwars"."finish" = $1 LIMIT $2  [["finish", false], ["LIMIT", 1]]
SELECT "guildwars".* FROM "guildwars" WHERE "guildwars"."guild_2_id" IS NULL AND "guildwars"."finish" = $1 LIMIT $2  [["finish", false], ["LIMIT", 1]]
---
    def self.find_war(guild_id)
        war = Guildwar.find_by(guild_1_id: guild_id, finish: false)
        if !war
            war = Guildwar.find_by(guild_2_id: guild_id, finish: false)